test/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
     p
     {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-07;
        relTol           0.0;
     }

     rho
     {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0;
     }

     U
     {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
     }

     c
     {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
     }

}

PISO
{ 
    nCorrectors              3;
    nNonOrthogonalCorrectors 2;
}


// ************************************************************************* //
